Repository: BloomBooks/BloomDesktop
Catalog: DistFiles/localization/Bloom.sw.tmx
Source language: sw
Languages: en

source: Bloom haijaweza kuunganishwa na mtandao ili kukamilisha kuingia kwako akaunti yako au kufungua akaunti mpya. Hii inaweza kuwa tatizo kutokana na uunganishaji wa intaneti, mtandao wetu, au baadhi ya vifaa hapo katikati.
en: Bloom could not connect to the server to complete your login or signup. This could be a problem with your internet connection, our server, or some equipment in between.

source: Ili kufungua akaunti ya BloomLibrary.org, unapaswa kuweka alama kwenye kisanduku ukiashiria kuwa unakubaliana na Sheria za Matumizi ya Maktaba ya Bloom.
en: In order to sign up for a BloomLibrary.org account, you must check the box indicating that you agree to the BloomLibrary Terms of Use.

source: Barua pepe inahitajika
en: Email Needed

source: Hatuna kwenye rekodi zetu yeyote anayetumia barua pepe hiyo. Je, ungependa kufungua akaunti?
en: We don't have a user on record with that email. Would you like to sign up?

source: Neno la siri na jina lako la utambulizo havikuambatana
en: Password and user ID did not match

source: Tafadhali kubaliana na Masharti ya Matumizi
en: Please agree to terms of use

source: Tafadhali weka anwani za barua pepe inayotumika. Tutatuma barua pepe kwa anwani hii ili uweze kubadilisha neno lako la siri.
en: Please enter a valid email address. We will send an email to this address so you can reset your password.

source: Bloom haijaweza kuunganishwa na mtandao ili kubadilisha neno lako la siri. Tafadhali angalia intaneti yako.
en: Bloom could not connect to the server to reset your password. Please check your network connection.

source: Ubadilishaji wa neno la siri umefeli
en: Reset Password failed

source: Kubadilisha neno la siri
en: Resetting Password

source: Tunatuma barua pepe kwa {0} ikiwa na maagizo ya jinsi ya kubadilisha neno lako la siri.
en: We are sending an email to {0} with instructions for how to reset your password.

source: Fungua akaunti yako kwa Maktaba ya Bloom.
en: Sign up for Bloom Library.

source: Mtumiaji asiyejulikana
en: Unknown user

source: Bloom haijaweza kuingia kwa BloomLibrary.org kwa kutumia hati za utambulisho zilizohifadhiwa. Tafadhali angalia intaneti yako.
en: Bloom could not log in to BloomLibrary.org using your saved credentials. Please check your network connection.

source: Toka kwenye BloomLibrary.org
en: Log out of BloomLibrary.org

source: Kutengeneza PDF Onyesho la awali...
en: Making PDF Preview...

source: Kutengeneza picha ya ukucha wa dole gumbai...
en: Making thumbnail image...

source: (Haipatikani)
en: (None found)

source: Samahani, tafsiri hii ya kompyuta ya Bloom haiambatani na tafsiri iliyopo yao BloomLibrary.org. Tafadhali ifanye kuwa ya tafsiri ya hivi karibuni.
en: Sorry, this version of Bloom Desktop is not compatible with the current version of BloomLibrary.org. Please upgrade to a newer version.

source: (nusu)
en: (partial)

source: Tafadhali ingia kwenye BloomLibrary.org (au ufungue akaunti) kabla ya kuweka
en: Please log in to BloomLibrary.org (or sign up) before uploading

source: Tafadhali andaa hii kutoka kwa chaguo la kuhariri
en: Please set this from the edit tab

source: Fungua akaunti ya BloomLibrary.org
en: Sign up for BloomLibrary.org

source: Hatua ya 1: Thibitisha Metadata
en: Step 1: Confirm Metadata

source: Hatua ya 2: Weka
en: Step 2: Upload

source: Pendekezo: Kupeana leseni bunifu ya Kawaida huifanya rahisi kwako kupeana idhini fulani kwa kila mtu.
en: Suggestion: Assigning a Creative Commons License makes it easy for you to clearly grant certain permissions to everyone.

source: Pendekezo: Leseni Bunifu za Kawaida, hufanya kuwa rahisi zaidi kwa wengine kutumia kitabu chako, hata kama hawana ufasaha katika lugha yako ya leseni ya kawaida.
en: Suggestion: Creative Commons Licenses make it much easier for others to use your book, even if they aren't fluent in the language of your custom license.

source: Muhtasari
en: Summary

source: Kulikuwa na tatizo katika kuweka kitabu chako. Hii huenda ikawa ni kwa sababu kompyuta yako imeundwa ili kutumia wakati usio sahihi wa eneo au saa yako ya mfumo ni mbaya sana. Tazama http://www.di-mgt.com.au/wclock/help/wclo_setsysclock.html jinsi ya kurekebisha hii.
en: There was a problem uploading your book. This is probably because your computer is set to use the wrong timezone or your system time is badly wrong. See http://www.di-mgt.com.au/wclock/help/wclo_setsysclock.html for how to fix this.

source: Mada
en: Title

source: Weka Kitabu
en: Upload Book

source: Hongera, "{0}" sasa kinapatikana kwenye BloomLibrary.org ({1})
en: Congratulations, "{0}" is now available on BloomLibrary.org ({1})

source: Haikubaliwi Kuweka Kitabu
en: Upload Not Allowed

source: Kulikuwa na tatizo katika kuweka kitabu chako. Unaweza kuhitajika kufungua upya Bloom au kupata usaidizii wa kiufudi.
en: There was a problem uploading your book. You may need to restart Bloom or get technical help.

source: Hali ya kuendelea kuweka
en: Upload Progress

source: Weka kitabu (kwenye Sandbox)
en: Upload Book (to Sandbox)

source: Kuweka metadata ya kitabu
en: Uploading book metadata

source: Kuweka {0}
en: Uploading {0}

source: Chaguo la kuhifadhi
en: Save stub

source: Ongeza Ngazi
en: Add Level

source: Ongeza Awamu
en: Add Stage

source: Tafadhali ongeza maandishi kwa folda ya Sampuli ya Maandishi.
en: Please add texts to the Sample Texts folder.

source: maneno yanayokubaliwa
en: allowed words

source: Faili za maneno zinazokubaliwa
en: Allowed Words File

source: Idadi ya juu zaidi ya maneno kwa kila kitabu
en: Maximum Words per Book

source: Chagua...
en: Choose...

source: Kliki kwenye herufi ili kuziongeza kwa awamu hii.
en: Click on letters to add them to this stage.

source: Tenganisha kwa kutumia uwazi
en: Separate by spaces

source: Kwa mfano "ai oo sh ng th"
en: E.g. "ai oo sh ng th ing"

source: Kuunganisha herufi (Grafimu)
en: Letter Combinations (Graphemes)

source: Awamu zinazoweza Kufasiriwa
en: Decodable Stages

source: Faili zinahitaji kupanuliwa kwa .TXT
en: File needs .TXT extension

source: Kwanza,
en: First,

source: Muundo huu hauwezi kusomeka
en: Cannot read this format

source: Saidia katika kutuma na kubadilisha faili ili kutumika kama sampuli ya maandishi
en: Help exporting and converting files to use as sample texts

source: Orodhesha herufi na herufi zinazounda maneno katika mpangilio wa alfabeti.
en: List letters and word-forming characters in alphabetic order.

source: Tenganisha kwa kutumia nafasi
en: Separate by spaces

source: Kwa mfano "a b ch d"
en: E.g. "a b c d"

source: Herufi na uunganishaji wa herufi
en: Letters and Letter Combinations

source: Ili kukusaidia kutengeneza kifaa cha kusoma kinachoweza kufasiriwa, Bloom inahitaji kujua herufi na uunganishaji wa herufi utakaokuwa ukifundisha.
en: To help you make decodable readers, Bloom needs to know the letters and letter combinations that you will be teaching.

source: Tenganisha kila herufi au uunganishaji wa herufi kwa nafasi. Kwa mfano, hapa ni kile tunachoweza kutumia kwa lugha ya Kiingereza:
en: Separate each letter or letter combination with a space. For example, here is what we might use for the English language:

source: Tambua kuwa orodha ya kiingereza inajumuisha alama zinazotumiwa kutengeneza maneno, kama ' katika
en: Notice that the English list includes symbols that are used to make words, like ' in

source: Ngazi za msomaji
en: Reader Levels

source: majina yanayoambatana
en: matching words

source: Urefu wa wastani wa juu zaidi wa sentensi katika kitabu
en: Maximum Average Length of Sentences in Book

source: Idadi ya juu zaidi ya maneno ya kipekee kwenye kitabu
en: Maximum Unique Words per Book

source: Maneno zaidi
en: More Words

source: Fungua folda ile ile ya maandishi kwa lugha hii.
en: Open the sample texts folder for this language.

source: Ukurasa
en: Page

source: Idadi ya juu zaidi ya maneno kwa kila ukurasa
en: Maximum Words on each Page

source: Imewezeshwa na
en: Powered by

source: Toa ngazi
en: Remove Level {0}

source: Toa Awamu {0}
en: Remove Stage {0}

source: Toa kutoka kwa ukurasa huu
en: Remove from this stage

source: Vuta mstari ili kupanga ngazi.
en: Drag rows to reorder levels.

source: Vuta mistari ili kupanga awamu.
en: Drag rows to reorder stages.

source: Orodha ya Maneno na Sampuli ya Matini
en: Word Lists and Sample Texts

source: Sampuli ya Maneno
en: Sample Words

source: , Injini ya Kutafuta ya Kusoma na Kuandika.
en: , the Search Engine for Literacy.

source: Herufi za hapo awali na zile mpya
en: Previous and New Letters

source: Sentensi
en: Sentence

source: Idadi ya juu zaidi ya maneno kwa kila Sentensi.
en: Maximum Words in each Sentence

source: Andaa kifaa cha Kusoma kinachoweza Kufasiriwa
en: Set up Decodable Reader Tool

source: Andaa kifaa cha kusoma kilichopewa ngazi
en: Set up Leveled Reader Tool

source: Andaa alfabeti ya lugha hii.
en: Set up the alphabet for this language.

source: Je, majina yanayoonekana ni nini?
en: What are sight words?

source: Majina mapya ya yanayoonekana
en: New Sight Words

source: Majina yanayoonekana
en: Sight Words

source: hatua
en: Stage

source: Mambo ya kukumbukwa kuhusu ngazi hii:
en: Things to remember for this level:

source: Kipekee
en: Unique

source: Maneno
en: Words

source: Ili kukusaidia kutengeneza vifaa vya kusoma vinavyoweza kufasiriwa, Bloom inaweza kupendekeza maneno ambayo yanaweza kutoshea kati ya awamu iliopo. Kuna njia mbili za kupeana majina kwa Bloom.
en: To help you make decodable readers, Bloom can suggest words that fit within the current stage. There are two ways to give words to Bloom:

source: 2) Weka Faili za Maandishi kwa
en: 2) Place Text Files in Your

source: Folda ya Sampuli yako ya Matini
en: Sample Texts Folder

source: 1) Piga Chapa Maneno yako Hapa
en: 1) Type Words Here

source: Tunatumia orodha ya maneno yaliyokubaliwa ili kutoa maelezo kuhusu awamu
en: We are using lists of allowed words to define stages

source: Tunatumia herufi zilizo na maneno yanayoonekana kutoa maelezo kuhusu awamu
en: We are using letters with sight words to define stages

source: Kwa kuongeza, seti hii ya Bloom itabeba mpangilio wa kifaa cha kusoma kilichopewa ngazi na kinachoweza kufasiriwa cha hivi karibuni cha lugha ya \"{0}\". Yeyote anayefungua seti hii ya Bloom, ambaye basi anafungua mkusanyiko wa \"{0}\" , atahitajika kubadilisha mpangilio wa kifaa chake cha kusoma kilichopewa ngazi na kutumia mpangilio ulio kwenye seti hii ya Bloom. Pia atapata kikundi cha majina ya kisasa ili kuyatumia kwenye vifaa vya kusoma vinavyoweza kufasiriwa.
en: In addition, this Bloom Pack will carry your latest decodable and leveled reader settings for the \"{0}\" language. Anyone opening this Bloom Pack, who then opens a \"{0}\" collection, will have their current decodable and leveled reader settings replaced by the settings in this Bloom Pack. They will also get the current set of words for use in decodable readers.

source: Vitabu vifuatavyo vitafanywa kuwa vigezo:
en: The following books will be made into templates:

source: Hifadhi seti ya Blooma
en: Save Bloom Pack

source: Tengeneza Seti ya Bloom ya Kifaa cha kusoma
en: Make Reader Template Bloom Pack

source: Barua pepe
en: Email Address

source: Jina la Kwanza
en: First Name

source: Tafadhali chukua dakika moja kujisaji {0}
en: Please take a minute to register {0}

source: Je, unaitumia vipi {0}?
en: How are you using {0}?

source: Nimekwama, nitamaliza hii baadaye
en: I'm stuck, I'll finish this later.

source: Mpangilio
en: Organization

source: U&jisajili
en: &Register

source: Jina la Familia
en: Surname

source: Jisajili {0}
en: Register {0}

source: Funga
en: Close

source: Bloom haikuweza kupeana ripoti yako moja kwa moja hadi kwa mtandao wetu.Tafadhali jaribu tena au uandike barua pepe {0} kwa {1}.
en: Bloom was not able to submit your report directly to our server. Please retry or email {0} to {1}.

source: Jumuisha Kitabu '{0}'
en: Include Book '{0}'

source: Jumuisha picha hii ya kutoka kwa skrini
en: Include this screenshot

source: Jina
en: Name

source: Jaribu tena
en: Retry

source: Tazama ni nini kingine kinapaswa kupeanwa
en: See what else will be submitted

source: U&peane
en: &Submit

source: Inapeana kwa mtandao...
en: Submitting to server...

source: Tulipokea ripoti yako, asante kwa kutenga muda wako ili kusaidia Bloom kuwa bora zaidi!
en: We received your report, thanks for taking the time to help make Bloom better!

source: Je, ni nini inaonekana kuwa tatizo?
en: What seems to be the problem?

source: Kufunga kitabu...
en: Zipping up book...

source: Haitakuwa siri
en: Will not be private

source: Naelewa. Usionyeshe hii tena.
en: I get it. Do not show this again.

source: Tafadhali tambua sampuli ya mpangilio wa mtambo wa kuchapisha hapa chini. Utumia kama mwongozo unapoandaa mtambo wa kuchapisha.
en: Please notice the sample printer settings below. Use them as a guide while you set up the printer.

source: Hesabu
en: Arithmetic

source: Kitabu cha Kimsingi
en: Basic Book

source: Kitabu Kikubwa
en: Big Book

source: Kifaa cha kusoma kinachoweza kufasiriwa
en: Decodable Reader

source: Kifaa cha kusoma kilichopewa Ngazi
en: Leveled Reader

source: Kamusi ya Picha
en: Picture Dictionary

source: Chanjo
en: Vaccinations

source: Kalenda ya Ukuta
en: Wall Calendar

source: Ukurasa ulio mtupu unaokuruhusu kuongeza vipengee.
en: A blank page that allows you to add items.

source: Ukurasa ulio na picha juu na jina kubwa lilioandikwa katikati hapa chini.
en: Page with a picture on top and a large, centered word below.

source: Tatizo 1
en: 1 Problem

source: Matatizo 2
en: 2 Problems

source: Matatizo 3
en: 3 Problems

source: Matatizo 4
en: 4 Problems

source: Alfabeti
en: Alphabet

source: Matini ya Kimsingi na Picha
en: Basic Text & Image

source: Ukurasa wa Sifa
en: Credits Page

source: Kaida
en: Custom

source: Siku ya 1
en: Day 1

source: Siku ya 2
en: Day 2

source: Siku ya 3
en: Day 3

source: Siku ya 4
en: Day 4

source: Siku ya 5a
en: Day 5a

source: Siku ya 5b
en: Day 5b

source: Kiwanda
en: Factory

source: Jalada la Mbele
en: Front Cover

source: Machapisho ya Mbele/Nyuma
en: Front/Back Matter

source: Picha Katikati
en: Image in Middle

source: Jalada la Ndani upande wa Nyuma
en: Inside Back Cover

source: Jalada la ndani upande wa nje
en: Inside Front Cover

source: Maagizo
en: Instructions

source: Maandishi tu
en: Just Text

source: Picha tu
en: Just a Picture

source: Jalada la Nyuma ya Nje
en: Outside Back Cover

source: Picha na neno
en: Picture & Word

source: Kihifadhi Karatasi kilicho Bora zaidi
en: Super Paper Saver

source: Ukurasa Huu Umeachwa Wazi Kimakusudi
en: This Page Is Intentionally Blank

source: Ukurasa wa Mada
en: Title Page

source: Jadi
en: Traditional

source: Pangilia
en: Setup

source: Kilimo
en: Agriculture

source: Hadithi za Wanyama
en: Animal Stories

source: Biashara
en: Business

source: Kuishi kwa Jamii
en: Community Living

source: Utamaduni
en: Culture

source: Kamusi
en: Dictionary

source: Mazingira
en: Environment

source: Ya Kubuniwa
en: Fiction

source: Jinsi ya
en: How To

source: Hakuna Mada
en: No Topic

source: Hakuna cha Kubuniwa
en: Non Fiction

source: Maendeleo ya Kibinafsi
en: Personal Development

source: Prima
en: Primer

source: Sayansi
en: Science

source: Kiroho
en: Spiritual

source: Kitabu cha hadithi
en: Story Book

source: Hadithi za Kitamaduni
en: Traditional Story
